<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=utf-8">
<title>Attachments Documentation</title>
<link href="../../css/admin.css" type="text/css" rel="stylesheet">
<link href="help.css" type="text/css" rel="stylesheet">
</head>
<body><a name="top" id="top"></a>
<h1>Attachments (Bilagor)<br>
  Hj&auml;lp och dokumentation<br>
</h1>
<h3>Version 1.3.4 - Augusti 2008</h3>

<ol>
<li><a href="#intro">Introduktion</a></li>
<li><a href="#uploads">Restriktioner f&ouml;r uppladdning</a></li>
<li><a href="#options">Inst&auml;llningar</a></li>
<li><a href="#display_filename">Visning av filnamn</a></li>
<li><a href="#styling">Formatera bilagelistor med CSS</a></li>
<li><a href="#icons">Ikoner f&ouml;r filtyper</a></li>
<li><a href="#warnings">Varningar</a></li>
<li><a href="#upgrading">Uppgradering</a></li>
<li><a href="#acknowledgements">Tack till</a></li>
</ol>

<h2><a name="intro"></a>Introduktion</h2>
Med till&auml;gget  &#039;Attachments&#039; f&ouml;r  Joomla! kan du ladda upp filer som bilagor till artiklar. &#039;Attachments&#039; best&aring;r av ett insticksprogram f&ouml;r att visa bilagorna och en komponent f&ouml;r att ladda upp och underh&aring;lla bilagor. Det g&aring;r att kontrollera vilka som kan se bilagorna eller ladda upp bilagor, liksom m&aring;nga andra inst&auml;llningar f&ouml;r att &ouml;ka till&auml;ggets flexibilitet och anv&auml;ndbarhet. Observera: alla inst&auml;llningar kontrolleras i komponenthanteraren. Detta till&auml;gg fungerar enbart i Joomla! 1.5 och senare.
<br>&nbsp;<br>

P&aring; denna sida kan du  prenumerera p&aring; en e-postlista f&ouml;r nyheter om detta till&auml;gg:
<ul class="url">
   <li><a title="Email list subscription page"
          href="http:/jmcameron.net/attachments/email-list.html"
          >http:/jmcameron.net/attachments/email-list.html</a>
   </li>
</ul>

Detta till&auml;gg kan spr&aring;kanpassas och st&ouml;der f&ouml;ljande spr&aring;k (f&ouml;rutom engelska):
<ul>
    <li><b>Bulgariska:</b> Denna &ouml;vers&auml;ttning &auml;r gjord av Stefan Ilivanov. (Tack Stefan!)</li>
    <li><b>Kinesiska:</b> &Ouml;vers&auml;ttning till traditionell och f&ouml;renklad kinesiska av baijianpeng
        (http://www.joomlagate.com).  (Tack baijaing!)</li>
    <li><b>Holl&auml;ndska:</b> Denna &ouml;vers&auml;ttning &auml;r gjord avParvus. (Tack Parvus!)</li>
  <li><b>Finska:</b> Denna &ouml;vers&auml;ttning &auml;r gjord avTapani Lehtonen. (Tack Tapani!) </li>
    <li><b>Franska:</b> Denna &ouml;vers&auml;ttning &auml;r gjord avPascal Adalian. (Tack Pascal!) </li>
    <li><b>Tyska:</b> Denna &ouml;vers&auml;ttning &auml;r gjord avMichael Scherer. (Tack Michael!) </li>
    <li><b>Grekiska:</b> Denna &ouml;vers&auml;ttning &auml;r gjord avHarry Nakos. (Tack Harry!) </li>
    <li><b>Italienska:</b> Denna &ouml;vers&auml;ttning &auml;r gjord avLemminkainen. (Tack Lemminkainen!) </li>
    <li><b>Norska:</b> Denna &ouml;vers&auml;ttning &auml;r gjord avEspen Gjelsvik. (Tack Espen!) </li>
    <li><b>Persiska:</b> Denna &ouml;vers&auml;ttning &auml;r gjord avHossein Moradgholi of the ParsJoomla project. (Tack Hossein!) </li>
    <li><b>Polska:</b> Denna &ouml;vers&auml;ttning &auml;r gjord avPiotr Wo?=jcik. (Tack Piotr!) </li>
    <li><b>Portugisiska/Brasilianska:</b> Denna &ouml;vers&auml;ttning &auml;r gjord avArnaldo Giacomitti
        (www.giacomitti.eng.br) and Cauan Cabral (www.cauancabral.net). </li>
    <li><b>Spanska:</b> Denna &ouml;vers&auml;ttning &auml;r gjord avCarlos Alfaro. (Tack Carlos!) </li>
    <li><strong>Svenska:</strong> Denna &ouml;vers&auml;ttning &auml;r gjord av Mats Elfstr&ouml;m. (Tack Mats!)</li>
</ul>
M&aring;nga tack till alla &ouml;vers&auml;ttare!  Kontakta g&auml;rna f&ouml;rfattaren om du vill hj&auml;lpa till med att &ouml;vers&auml;tta till&auml;gget till n&aring;got annat spr&aring;k, (se l&auml;ngst ned).
<span class="atop"><a href="#top">[Till sidans topp]</a></span>

<h2><a name="uploads"></a>Restriktioner f&ouml;r uppladdning</h2>
Alla filtyper kan inte laddas upp. Till&auml;gget  &#039;Attachments&#039; kommer att stoppa uppladdning av filer som inte till&aring;ts av Joomla!s Mediahanterare. F&ouml;r att se (eller &auml;ndra) vilka filtyper som  till&aring;ts, g&aring; till <strong>Globala inst&auml;llningar</strong> och klicka p&aring; <strong>System</strong>. I gruppen <em>Mediainst&auml;llningar</em> kan du v&auml;lja vilka filtyper och mime-typer som &auml;r till&aring;tna f&ouml;r uppladdning. &#039;Attachments&#039; respekterar dessa inst&auml;llningar men ignorerar <em>Till&aring;tna bildtyper (fil&auml;ndelser)</em>.
<span class="atop"><a href="#top">[Till sidans topp]</a></span>

<h2><a name="options"></a>Attachments Inst&auml;llningar</h2>
Alla inst&auml;llningar f&ouml;r  &#039;Attachments&#039; sk&ouml;ts i komponenthanteraren. G&aring; in in adminstrat&ouml;rsgr&auml;nssnittet och v&auml;lj 'Attachments' under menyn Komponenter f&ouml;r att &auml;ndra inst&auml;llningarna.  Klicka p&aring;  "Inst&auml;llningar&quot; till h&ouml;ger bland verktygen f&ouml;r att se listan p&aring; parameterar f&ouml;r till&auml;gget. Det finns de h&auml;r parametrarna:<br>
<ul>

<li><strong>Vem som kan se bilagor:</strong> Denna inst&auml;llning best&auml;mmer vilka som kan se l&auml;nkarna till de bifogade filerna. F&ouml;r n&auml;rvarande finns tv&aring; val:
  <ol>
<li>&#039;<i>Alla</i>&#039; - Om detta &auml;r valt kan alla bes&ouml;kare se l&auml;nkarna till de bifogade filerna, oavsett om de &auml;r inloggade eller inte.</li>
<li>&#039;<i>Alla inloggade anv&auml;ndare</i>&#039; - Om detta &auml;r valt kan l&auml;nkarna bara ses av inloggade anv&auml;ndare.</li>
</ol>
</li>

<li><strong>Vilka kan l&auml;gga till bilagor:</strong> Denna inst&auml;llning kontrollerar vilka som kan l&auml;gga till bilagor till artiklar. Det finns tv&aring; val::
  <ol>
<li>&#039;<i>Endast artikelns f&ouml;rfattare</i>&#039; - L&auml;nken f&ouml;r att ladda upp bilagor &auml;r bara synlig f&ouml;r artikelns f&ouml;rfattare (och anv&auml;ndare med h&ouml;gre beh&ouml;righet som Redakt&ouml;rer och Administrat&ouml;rer).</li>
<li>&#039;<i>Alla inloggade anv&auml;ndare</i>&#039; - L&auml;nken f&ouml;r att ladda upp bilagor &auml;r synlig f&ouml;r alla bes&ouml;kare.</li>
</ol>
</li>

<li><strong>Publicera bilagorna omedelbart:</strong> Denna inst&auml;llning f&ouml;r  omedelbar publicering kontrollerar om nytillagda bilagor publiceras genast eller inte. Vid Ja blir bilagorna genast publicerade och synliga f&ouml;r alla bes&ouml;kare. Vid Nej publiceras inte bilagorna automatiskt. De m&aring;ste d&aring; f&ouml;rst publiceras av en Administrat&ouml;r via Adminstrat&ouml;rsgr&auml;nssnittet f&ouml;r att bli synliga  f&ouml;r bes&ouml;kare.</li>

<li><strong>Varning f&ouml;r automatisk publicering:</strong> Om funktionen f&ouml;r automatisk publicering &auml;r avslagen (f&ouml;reg&aring;ende funktion) kan det vara l&auml;mpligt att informera dem som laddar upp bilagor om detta, och hur de ska g&ouml;ra f&ouml;r att f&aring; bilagan publicerad. Skriv ett l&auml;mpligt meddelande h&auml;r. Om f&auml;ltet l&auml;mnas tomt levereras ett allm&auml;nt systemmeddelande att kontakta webbplatsens administrat&ouml;r f&ouml;r att f&aring; den nya bilagan publicerad. </li>

<li><strong>Visa rubriker:</strong> Vid Ja visas beskrivande rubriker &ouml;ver kolumnerna p&aring; listan med bilagor.</li>

<li><strong>Visa beskrivningar:</strong> Denna inst&auml;llning kontrollerar om bilagans beskrivning ska visas i listan.</li>

<li><strong>Visa vem som laddat upp bilagan:</strong> Visar anv&auml;ndarnamnet p&aring; den som har laddat upp bilagan.</li>

<li><strong>Visa filstorlek:</strong> Denna inst&auml;llning kontrollerar om filstorleken kommer att visas i listan med bilagor.</li>

<li><strong>Visa antal nedladdingar:</strong> Denna inst&auml;llning kontrollerar om antal nedladdningar kommer att visas i listan med bilagor. 
<strong>VARNING:</strong> Detta val fungerar bara i s&auml;kert l&auml;ge. I l&auml;ge 'bilaga' anropas filerna direkt utan att passera Joomla!-koden. D&auml;rf&ouml;r &auml;r det inte m&ouml;jligt att f&aring;nga och r&auml;kna antal nedladdningar i det l&auml;get. Av det sk&auml;let visas antal nedladdningar bara i l&auml;ge 'Inline' n&auml;r Ja &auml;r valt h&auml;r.</li>

<li><strong>Visa &auml;ndringsdatum:</strong> Vid Ja visas senaste &auml;ndringsdatum f&ouml;r filen i listan &ouml;ver bilagor till en artikel. Vid Nej visas inget datum.</li>

<li><strong>Format f&ouml;r &auml;ndringsdatum:</strong> Du kan v&auml;lja datumformat enligt PHP-funktionen strftime().  S&ouml;k p&aring; n&auml;tet med 
&#039;PHP strftime&#039; f&ouml;r att hitta exempel.  Det f&ouml;rvalda formatet  (%x&nbsp;%H:%M)
ger datum med 24-timmarsklocka s&aring; h&auml;r; 4/28/2008&nbsp;14:21.  Slopa delen "%H:%M" f&ouml;r att ta bort klocktiden. Notera att PHP under MS Windows eller Linux kan st&ouml;dja olika koder f&ouml;r tidsformat.</li>

<li><strong>Namn f&ouml;r anv&auml;ndardefinierade f&auml;lt 1-3: </strong> Programmet ger m&ouml;jlighet att defiera upp till tre anv&auml;ndardefinierade f&auml;lt f&ouml;r att   l&auml;gga till ytterligare information om  dina bilagor. Skriv in den &ouml;nskade ben&auml;mningen f&ouml;r vart och ett av f&auml;lten h&auml;r. Radera namnet f&ouml;r att ta bort visning och redigering av f&auml;ltet. F&auml;lten kommer att visas i den ordning som de visas h&auml;r. F&auml;ltnamnet f&aring;r vara h&ouml;gst 40 tecken och f&auml;lten kan inneh&aring;lla upp till 100 tecken. </li>

<li><strong>Bilagornas listordning:</strong> H&auml;r v&auml;ljer du sorteringsordning f&ouml;r bilagorna i listan. De flesta ben&auml;mningarna &auml;r sj&auml;lvbeskrivande:
  <ol>
<li>&#039;<i>Filnamn</i>&#039; - Sorterar alfabetiskt p&aring; filnamn.</li>
<li>&#039;<i>Filstorlek (minst f&ouml;rst)</i>&#039; </li>
<li>&#039;<i>Filstorlek (st&ouml;rst f&ouml;rst)</i>&#039; </li>

<li>&#039;<i>Beskrivning</i>&#039; </li>
<li>&#039;<i>Skapad datum (&auml;ldst f&ouml;rst)</i>&#039; </li>
<li>&#039;<i>Skapad datum  (nyast f&ouml;rst)</i>&#039; </li>
<li>&#039;<i>&Auml;ndrad datum (&auml;ldst f&ouml;rst)</i>&#039; </li>
<li>&#039;<i>&Auml;ndrad datum (nyast f&ouml;rst)</i>&#039; </li>
<li>&#039;<i>Bilage-ID</i>&#039; - Sorterar bilagorna efter deras ID i databasen. Effekten blir att bilagorna redovisas i den ordning de skapades.</li>
<li>&#039;<i>Anv&auml;ndardefinierat f&auml;lt 1</i>&#039; </li>
<li>&#039;<i>Anv&auml;ndardefinierat f&auml;lt 2</i>&#039; </li>
<li>&#039;<i>Anv&auml;ndardefinierat f&auml;lt 3</i>&#039; </li>
</ol>
 </li>

<li><strong>Maximal l&auml;ngd p&aring; filnamn:</strong>
Maximal l&auml;ngd f&ouml;r filnamn i listan &ouml;ver bilagor. L&auml;ngre filnamn kommer att trunkeras i listan (enbart i visningen, de  verkliga filnamnen &auml;ndras inte). V&auml;rdet 0 betyder ingen begr&auml;nsning (men f&auml;ltet f&ouml;r filnamn i databasen &auml;r begr&auml;nsat till 80 tecken). Obs: Om filnamnen begr&auml;nsas med denna inst&auml;llning kommer det f&ouml;rkortade namnet att skrivas i f&auml;ltet 'visat filnamn'.</li>

<li><strong>CSS-stil f&ouml;r bilagornas tabellutseende:</strong> Ange ditt eget stilnamn h&auml;r om vill anv&auml;nda en annan stil &auml;n den f&ouml;rvalda som &auml;r 'attachmentsList&#039;.  Se stycket <a href="#styling">[Design av bilagelistan]</a> f&ouml;r mer information.</li>

<li><strong>S&auml;tt att &ouml;ppna l&auml;nkar till filer:</strong>
Denna inst&auml;llning styr hur l&auml;nkade bilagor kommer att &ouml;ppnas. 'I samma f&ouml;nster' betyder att filen &ouml;ppnas i samma webbl&auml;sarf&ouml;nster. 'I nytt f&ouml;nster' betyder att filen &ouml;ppnas i ett nytt f&ouml;nster. I vissa webbl&auml;sare betyder detta att filen &ouml;ppnas under en ny flik.</li>

<li><strong>Prefix till filnamn:</strong> Denna inst&auml;llning styr om ett numeriskt prefix ska tillfogas filnamnet n&auml;r filen lagras p&aring; servern. Det finns tre val:
  <ol>
<li>&#039;<i>Artikel-ID</i>&#039; - Detta val g&ouml;r att filen f&aring;r artikelns ID som prefix. Det minskar risken f&ouml;r kolliderande filnamn och s&auml;kerst&auml;ller att en viss artikels bilagor sorteras tillsammans i en kalaloglistning. Notera ocks&aring; att valet g&ouml;r det m&ouml;jligt att bifoga olika filer med samma namn till olika artiklar, men inte till samma artikel.</li>
<li>&#039;<i>Bilagans  ID</i>&#039; - Detta val ger bilagans ID-nummer som prefix till filnamnet. Det f&ouml;rhindrar kolliderande filnamn eftersom varje bilaga alltid har ett unikt ID-nummer. Bilagorna kommer att sorteras i den ordning de har lagts till i kataloglistan.</li>
<li>&#039;<i>Inget</i>&#039; - Detta val skapar inget prefix och bilagan lagras med of&ouml;r&auml;ndrat filnamn. Det g&ouml;r att risken &ouml;kar f&ouml;r kolliderande filnamn eftersom varje uppladdad fil m&aring;ste ha ett unikt namn.</li>
</ol>
</li>

<li><strong>Underkatalog f&ouml;r uppladdning:</strong> Programmet  &#039;Attachments&#039;
placerar sina filer i en underkatalog p&aring; roten till din Joomla! webbplats. F&ouml;rvalt namn p&aring; katalogen &auml;r  &#039;attachments&#039;.
Notera att enbart kommade uppladdningar p&aring;verkas on du byter till en annan katalog. Tidigare uppladdade filer ligger kvar i sin gamla katalog, och deras poster i databasen pekar dit. Om du beh&ouml;ver  flytta alla filer till en annan katalog m&aring;ste du g&ouml;ra det med en filhanterare och d&auml;refter  manuellt uppdatera alla poster i databasen till att peka p&aring; den nya platsen.</li>

<li><strong>Egna rubriker p&aring; listorna &ouml;ver bilagor:</strong> Som f&ouml;rvalt v&auml;rde s&auml;tter  programmet rubriken 'Bilagor' p&aring; listan &ouml;ver bilagor till en artikel (om s&aring;dana finns). I vissa fall kan en annan rubrik vara l&auml;mpligare. Du har m&ouml;jlighet att ange en annan rubrik f&ouml;r varje enskild artikel. Om du till exempel vill ha rubriken 'Nedladdningsbara filer' i artikel 211, anger du h&auml;r '211 Nedladdningsbara filer' (utan apostrofer). Skriv en post per rad.
<br>
&nbsp;<br>
Anm.: Om du globalt vill &auml;ndra rubriken f&ouml;r alla bilagelistor kan du redigera  din lokala spr&aring;kfil nedan, i raden f&ouml;r &#039;ATTACHMENTS TITLE&#039;.
<pre>
    administrator/language/qq-QQ/qq-QQ.plg_frontend_attachments.ini
</pre>
D&auml;r  qq-QQ st&aring;r f&ouml;r din g&auml;llande spr&aring;kkod, exmpelvis sv-SE f&ouml;r svenska. (Om du inte &auml;r bekant md Joomla! spr&aring;kfiler, hitta raden som har &#039;ATTACHMENTS TITLE&#039; p&aring; v&auml;nster sida om tecknet  &#039;=&#039;.  &Auml;ndra som du vill efter likhetsecket, men &auml;ndra inget f&ouml;re det.)</li>

<li><strong>G&ouml;m bilagelistan f&ouml;r: </strong>
Detta &auml;r en kommaseparerad lista p&aring; nyckelord eller Sektioner/Kategorier f&ouml;r vilka listan &ouml;ver bilagor inte kommer att visas. Tv&aring; speciella nyckelord kan anv&auml;ndas: 
&#039;frontpage&#039; f&ouml;r att d&ouml;lja bilagelistor p&aring; f&ouml;rstasidan, och
&#039;all_but_article_views&#039; f&ouml;r att visa listorna bara i artikelvyer. (Nyckelorden skrivs utan apostrofer). ID-nummer f&ouml;r Sektion/Kategori skrivs som siffror med ett snedstreck (/) emellan:
Sektion#/Kategori#, Sektion#/Kategori#.  Ange bara  &#039;Sektion#&#039; f&ouml;r att t&auml;cka alla dess Kategorier.  Till exempel: 23/10, 23/11, 24</li>

<li><strong>S&auml;kra nedladdningsbara bilagor:</strong> I f&ouml;rvalt l&auml;ge sparas bilagefilerna i en allm&auml;nt &aring;tkomlig underkatalog. Om du v&auml;ljer <em>s&auml;ker</em> h&auml;r s&aring; kommer underkatalogen att bli  blockerad mot direkt &aring;tkomst. Nedladdningsl&auml;nkarna i anv&auml;ndargr&auml;nssnittet kommer att ladda ned filerna men blir indirekta l&auml;nkar. Detta f&ouml;rhindar access f&ouml;r anv&auml;ndare utan r&auml;tt beh&ouml;righet. Om du inte v&auml;ljer s&auml;kert l&auml;ge visas l&auml;nkarna enligt inst&auml;llningarna ovan, men filerna kommer att bli tillg&auml;ngliga f&ouml;r alla som k&auml;nner till deras URL, eftersom underkatalogen &auml;r publik. L&auml;get <em>s&auml;ker</em> f&ouml;rhindrar access f&ouml;r icke beh&ouml;riga anv&auml;ndare, &auml;ven om de vet filernas URL, eftersom valet f&ouml;rhindrar publik access till bilagornas underkatalog.
<li><strong>Nedladdningsmetod vid s&auml;ker nedladdning:</strong>
Detta val best&auml;mmer om bilagorna kommer att laddas ned som separata filer, eller &ouml;ppnas i webbl&auml;saren (om webbl&auml;saren kan hantera filtypen) Det finns tv&aring; alternativ:
  <ul>
    <li><i>&#039;inline&#039;</i>: I detta l&auml;ge visas bilagor i webbl&auml;saren, om webbl&auml;saren kan visa filtypen (som till exempel text och bilder). </li>
    <li><i>&#039;bilaga' </i>: I detta l&auml;ge kommer bilagorna alltid att laddas ned som separata filer. </li>
</ul><br>
Filer som inte kan visas i webbl&auml;saren kommer alltid att laddas ned som externa filer. </li>
</ul>
<span class="atop"><a href="#top">[Till sidans topp]</a></span>

<h2><a name="display_filename"></a>Visat Filnamn</h2>
<p>Det normala &auml;r att visa hela filnamnet som en l&auml;nk f&ouml;r att ladda ned registrerade bilagor. I vissa fall kan filnamnet vara f&ouml;r l&aring;ngt f&ouml;r att detta ska vara praktiskt. I formul&auml;ret f&ouml;r att ladda upp filer finns ett f&auml;lt, 'Visat filnamn' d&auml;r den som laddar upp filen kan ange ett alternativt namn eller ben&auml;mning att visa ist&auml;llet f&ouml;r det fulla filnamnet. H&auml;r kan till exempel anges n&aring;gon f&ouml;rkortning av filnamnet. Detta f&auml;lt kan redigeras i administrat&ouml;rsgr&auml;nssnittet f&ouml;r att redigera bilagor. Anm.: Det finns en annan inst&auml;llning,  "Maximal l&auml;ngd p&aring; filnamn" i instickprogrammets inst&auml;llningar. Detta kan st&auml;llas in att automatiskt trunkera det visade filnamnet till en given l&auml;ngd; det trunkerade namnet kommer att skrivas till f&auml;ltet 'Visat filnamn'. </p>
<p><span class="atop"><a href="#top">[Till sidans topp]</a></span>
  
</p>
<h2><a name="styling"></a>Att formatera  bilagelistorna med CSS</h2>
Listorna p&aring; bilagor i anv&auml;ndargr&auml;nssnittet g&ouml;rs med en speciell 'div'-klass som inneh&aring;ller en tabell. Denna tabell &auml;r associerad med flera olika CSS-klasser f&ouml;r att ge webbutvecklaren full flexibilitet att formatera tabellen. Se exempel  p&aring;  hur det g&ouml;rs i insticksprogrammets CSS-fil (i plugins/content/attachments.css). Om du vill &auml;ndra p&aring;  utseendet, g&ouml;r g&auml;rna s&aring; att du kopierar originalstilarna till filens slut, och d&ouml;p om &#039;attachmentsList&#039; i den kopierade delen till n&aring;got annat. Redigera parametern f&ouml;r Attachments 
(i komponenthanteraren) och &auml;ndra parametern  <i>attachments table style</i>
till ditt nya klassnamn. &Auml;ndra sedan definitionerna i den kopierade delen p&aring; det s&auml;tt du vill. Genom att g&ouml;ra s&aring; h&auml;r kan du enkelt &aring;terf&aring; originalutseendet genom att &auml;ndra parametern <i>attachments table style</i> till det tidigare f&ouml;rvalda  &#039;attachmentList&#039;. En annan f&ouml;rdel &auml;r att sektioenen med din &auml;ndrade stil kan kopieras till en fil och l&auml;tt h&auml;mtas tillbaka vid en versionsuppgradering av programmet. Detta kan ocks&aring; g&ouml;ras med ett CSS @import kommando.

<span class="atop"><a href="#top">[Till sidans topp]</a></span>

<h2><a name="icons"></a>Ikoner f&ouml;r filtyper</h2>
Till&auml;gget &#039;Attachments&#039; visar en ikon f&ouml;r filtypen vid varje post i listan &ouml;ver bilagor. G&ouml;r s&aring; h&auml;r om du vill l&auml;gga till en ikon f&ouml;r ytterligare filtyper:
(1) Placera en l&auml;mplig ikon i katalogen &#039;media/attachments/icons&#039;, om d&auml;r inte  redan finns en f&ouml;r din &ouml;nskade filtyp; (2) Redigera filen 
&#039;components/com_attachments/file_types.php&#039; och l&auml;gg till en rad f&ouml;r din filtyp i listan  $attachments_icon_from_file_extension som kopplar  filtill&auml;gget till ett ikonnamn (fr&aring;n katalogen media/attachments/icons). Om det inte fungerar m&aring;ste du kanske &auml;ven l&auml;gga till en rad i  $attachments_icon_from_mime_type. (3)
Gl&ouml;m inte att kopiera ikonfilen och din &auml;ndrade file_types.php till en extern katalog om du i framtiden uppgraderar Attachments.

<span class="atop"><a href="#top">[Till sidans topp]</a></span>

<h2><a name="warnings"></a>Varningar</h2>
<ul>
<li><strong>Om du laddar upp bilagor med k&auml;nslig eller privat information, se till att aktivera <em>S&auml;kra nedladdningsbara bilagor</em>!</strong><br>
 Om du inte anv&auml;nder den funktionen lagras dina bilagor i en publik underkatalog och blir &aring;tkomliga f&ouml;r var och en som vet den fulla URL-adressen. Valet <em>s&auml;ker</em> hindrar  &aring;tkomst f&ouml;r alla som inte har r&auml;tt beh&ouml;righet (enligt inst&auml;llningarna ovan). Se avsnittet <em>S&auml;kra nedladdningsbara bilagor</em> ovan f&ouml;r mer information.</li>

<li>Varje g&aring;ng en fil laddas upp kontrolleras att lagringskatalogen existerar, och den skapas om den inte finns. Det f&ouml;rvalda v&auml;rdet &auml;r 'attachments' i rotkatalogen f&ouml;r din webbplats. Namnet p&aring; underkatalogen kan &auml;ndras i 'Underkatalog f&ouml;r uppladdning'. Om till&auml;gget 
&#039;Attachments&#039; inte kan skapa sin underkatalog sj&auml;lv m&aring;ste du g&ouml;ra det manuellt (och du kan f&aring; problem med att ladda upp filer). Se till att s&auml;tta l&auml;mpliga skrivr&auml;ttigheter p&aring; katalogen i s&aring; fall. I Unix/Linux-v&auml;rlden inneb&auml;r det troligen n&aring;got i stil med 775. Observera att toppniv&aring;n p&aring; din webbplats kan ha begr&auml;nsningar s&aring; att webservern (och PHP) inte till&aring;ts att skapa underkataloger. Du kan beh&ouml;va l&auml;tta p&aring; s&aring;dana restriktioner tillf&auml;lligt f&ouml;r att till&aring;ta programmet att skapa sin underkatalog.</li>

<li>Om detta till&auml;gg inte till&aring;ter dig att ladda upp vissa filtyper (till exempel zip-filer) kan detta bero p&aring; att Attachments respekterar Mediahanterarens inst&auml;llningar vilka   filtyper som till&aring;ts f&ouml;r  uppladdning. Syftet &auml;r att stoppa potentiellt farliga filer som html eller php. Administrat&ouml;ren kan &auml;ndra dessa inst&auml;llningar under Globala inst&auml;llningar i menyn f&ouml;r Webbplats, fliken System. Under Mediainst&auml;llningar h&auml;r kan &ouml;nskade mime-typer l&auml;ggas till i listorna.</li>

<li>Det andra insticksprogrammet, &#039;add_attachment_btn_plugin&#039; (som kallas  &#039;Editor Button - AddAttachment&#039;
i hanteraren f&ouml;r insticksprogram) g&ouml;r att bilagor kan l&auml;ggas till artiklar under redigering i redigeringsgr&auml;nssnittet. Insticksprogrammet l&auml;gger till en knapp 'L&auml;gg till bilaga' under redigeringsf&ouml;nstret. Om du inte ser denna knapp fast du har installerat insticksprogrammet kan det bero p&aring; att det inte &auml;r aktiverat i menyn f&ouml;r Insticksprogram. L&auml;gg m&auml;rke till att knappen syns &auml;ven f&ouml;r en helt ny artikel under redigering, men inte kan anv&auml;ndas och visar en varning tills  artikeln &auml;r sparad en g&aring;ng. Artiklarna m&aring;ste existera (ha f&aring;tt ett ID) innan de kan f&aring; bilagor.</li>

<li>Om du inte kan se Attachments i anv&auml;ndargr&auml;nssnittet kan det ha flera sk&auml;l:
  <ul>
     <li>Insticksprogrammet  &#039;Content - Attachments&#039; &auml;r inte aktiverat. G&ouml;r det i hanteraren f&ouml;r Insticksprogram. </li>
     <li>Inst&auml;llningen f&ouml;r vilka som kan se bilagor &auml;r begr&auml;nsad till inloggade anv&auml;ndare, och du &auml;r inte inloggad. Inst&auml;llningen &auml;ndras i Komponenthanteraren. </li>
     <li>Insticksprogrammet  &#039;Content - Attachments&#039; har inte &aring;tkomstniv&aring;n Publik (i hanteraren f&ouml;r Insticksprogram). </li>
  </ul>
</li>

<li> Om du f&aring;r problem med storleksbegr&auml;nsningar f&ouml;r filer du f&ouml;rs&ouml;ker ladda upp, prova att l&auml;gga till f&ouml;ljande rader i filen .htaccess i rotkatalogen p&aring; din Joomla! webbplats:
  <pre>
  php_value upload_max_filesize 32M
  php_value post_max_size 32M
</pre>
d&auml;r du &auml;ndrar m&aring;ttet  32M (megabytes) till vad du vill s&auml;tta som maximal filstorlek f&ouml;r uppladdning.</li>

<li>Det finns ett hj&auml;lpforum och ett FAQ-forum f&ouml;r Attachments p&aring; webbplatsen Joomlacode (p&aring; engelska). R&aring;dfr&aring;ga dessa om du st&ouml;ter p&aring; n&aring;got problem som inte behandlas i denna hj&auml;lpfil.
  <ul class="url">
  <li><a title="Attachments forums at Joomlacode.org"
         href="http://joomlacode.org/gf/project/attachments/forum/"
         >Attachments Forums at Joomlacode.org</a></li>
</ul>
</li>
</ul>
<span class="atop"><a href="#top">[Till sidans topp]</a></span>

<h2><a name="upgrading"></a>Uppgradering</h2>
F&ouml;lj denna anvisning om du vill uppgradera programmet och bevara redan registrerade bilagor:
<ol>
<li><i>[Detta steg &auml;r valfritt men h&ouml;gst rekommendabelt, f&ouml;r att se till att du har en s&auml;kerhetskopia av databasen om n&aring;got g&aring;r fel.]</i><br>
Anv&auml;nd  <a href="http://www.phpmyadmin.net/home_page/index.php">phpMyAdmin</a>
(eller annat verktyg f&ouml;r  SQL redigering) f&ouml;r att spara inneh&aring;llet i tabellen  jos_attachments table (Anv&auml;nd valet  &#039;Export&#039; med &#039;Kompletta infogningar&#039; f&ouml;r data  (inte  &#039;Ut&ouml;kade infogningar').  Du b&ouml;r ocks&aring; s&auml;kerhetskopiera uppladdade bilagor (vanligen i underkatalogen &#039;attachments&#039;).</li>

<li>G&aring; till hanteraren f&ouml;r  Attachments i administrat&ouml;rsgr&auml;nssnittet och klicka p&aring; knappen Admin l&auml;ngst till h&ouml;ger bland  verktygen.
Klicka p&aring; valet <em>Avaktivera avinstallation av Attachments MySQL-tabell</em>.
Detta bevarar databasen vid en avinstallation av komponenten Attachments.</li>

<li>Avinstallera komponenten  &#039;Attachments'.</li>

<li>Avinstallera alla insticksprogram som h&ouml;r till  &#039;Attachments&#039;.</li>

<li>Installera den nya programversionen genom att packa upp releasefilen och installera komponenten och alla insticksprogram. Databasen med bilagor kommer automatiskt att uppdateras under installationen.</li>

<li>Aktivera alla  &#039;Attachments&#039; insticksprogram. </li>

<li>Nu ska alla dina bilagor vara tillg&auml;ngliga igen. G&aring; till hanteraren f&ouml;r Attachments
i administrat&ouml;rsgr&auml;nsnsnittet f&ouml;r att s&auml;kerst&auml;lla att allt fungerar som det ska.</li>
</ol>
<p> L&auml;gg m&auml;rke till att en avinstallation av till&auml;gget &#039;Attachments&#039; inte raderar tidigare uppladdade filer, men raderar programmets tabell i databasen. S&aring; efter en ominstallation till en ny version av 'Attachments' &auml;r det bara n&ouml;dv&auml;ndigt att &aring;terst&auml;lla den tabellen f&ouml;r att &aring;terst&auml;lla alla bilagor.</p>

<p>
Om du v&auml;ljer att inte &aring;terst&auml;lla databasen &auml;r det viktigt att du manuellt raderar &ouml;verblivna uppladdade f&ouml;r att undvika framtida konflikter med filnamn i katalogen med bilagor.  <span class="atop"><a href="#top">[Till sidans topp]</a></span></p>

<h2><a name="acknowledgements"></a>Tack till</h2>
M&aring;nga tack till f&ouml;ljande bidragsgivare eller k&auml;llor:
<ul>
    <li>Boken <i>Learning Joomla! 1.5 Extension Development: Creating Modules,
    Components, and Plugins with PHP</i> av  Joseph L. LeBlanc som var till stor hj&auml;lp f&ouml;r att skapa till&auml;gget &#039;Attachments&#039;.    </li>
  <li>M&aring;nga tack till  Paul McDermott som gener&ouml;st sk&auml;nkte insticksprogrammet f&ouml;r s&ouml;kning!
    Det &auml;r ett mycket anv&auml;ndbart till&auml;gg!
    </li>
    <li>Ikonerna f&ouml;r filtyper kommer fr&aring;n m&aring;nga olika k&auml;llor, bland andra:
        <ul>
           <li><a href="http://www.famfamfam.com/lab/icons/silk/">The Silk
           icons av Mark James (http://www.famfamfam.com/lab/icons/silk/)</a></li>
           <li><a href="http://www.zap.org.au/documents/icons/file-icons/sample.html">File-Type
           Icons 1.2 av John Zaitseff (http://www.zap.org.au/documents/icons/file-icons/sample.html)</a></li>
           <li><a href="http://www.brandspankingnew.net/archive/2006/06/doctype_icons_2.html">Doctype
           Icons 2 av Timothy Groves (http://www.brandspankingnew.net/archive/2006/06/doctype_icons_2.html)</a></li>
           <li><a href="http://www.catnip.co.uk/opendocument/icons/">OpenDocument icons f&ouml;reslagna av
           Pete Harlow (http://www.catnip.co.uk/opendocument/icons/)</a></li>
           <li><a href="http://sweetie.sublink.ca">Sweeties Base Pack av Joseph North (http://sweetie.sublink.ca)</a></li>
       </ul>
       <br>
       L&auml;gg m&auml;rke till att de flesta ikonerna i  &#039;Attachments&#039; &auml;r modifierade versioner av originalen p&aring; dessa webbplatser.  Ladda ned orignalen fr&aring;n l&auml;nkarna ovan om du vill ha dem.    </li>
</ul>
<span class="atop"><a href="#top">[Till sidans topp]</a></span>

<p>Rapportera buggar och f&ouml;rslag (p&aring; engelska) till <a href="mailto:jmcameron@jmcameron.net">jmcameron@jmcameron.net</a>.</p>
</body>
</html>
